In [2]:
import zipfile

In [8]:
path_to_zip_file = "learn-data-analysis-w-python-master.zip"
dir_to_extract_to = ""

In [14]:
with zipfile.ZipFile(path_to_zip_file, 'r') as extr:
    extr.extractall(dir_to_extract_to)

---

In [16]:
# Loading Data from csv Files

In [47]:
import pandas as pd
import numpy as np
df1_loc = "datasets/smallgradesh.csv"
df1 = pd.read_csv(df1_loc) # Includes headers

In [34]:
print(df1.head()) # data_frame .head() method displays first 5 rows

      Name  Grade
0   Marcia   82.4
1   Kadeem   78.2
2     Nash   79.3
3  Noelani   83.2
4  Noelani   87.4

In [43]:
df1.size

4000

In [42]:
print(df1.shape)

(2000, 2)

In [45]:
df1.columns

Index(['Name', 'Grade'], dtype='object')

In [52]:
df2_loc = "datasets/smallgrades.csv"
df2 = pd.read_csv(df2_loc, header=None)

In [53]:
df2.head()

         0     1
0   Marcia  82.4
1   Kadeem  78.2
2     Nash  79.3
3  Noelani  83.2
4  Noelani  87.4

In [55]:
df2.shape

(2000, 2)

In [58]:
df2.columns # it does not have any headers

Int64Index([0, 1], dtype='int64')

In [61]:
# Lets give it some headers
df2.columns = ['Names', 'Grades']

In [66]:
df2.columns
df2.head(2)

# they can also be added while we LOAD the data
# df2 = pd.read_csv(df2_loc, names = ['Grades', 'Names']) 
# The data was loaded without the header initially, so we added it later.

    Names  Grades
0  Marcia    82.4
1  Kadeem    78.2

---

In [68]:
# Lets load Florida population
csv_loc = "FloridaPopulation.csv"
df_florida = pd.read_csv(csv_loc)

In [71]:
df_florida.head()

,GEOID,SUMLEV,STATE,COUNTY,CBSA,CSA,NECTA,CNECTA,NAME,POP100,HU100,POP100.2000,HU100.2000,P001001,P001001.2000
0,12,40,12,NaN,NaN,NaN,NaN,NaN,Florida,18801310,8989580,15982378,7302947,18801310,15982378

In [74]:
df_florida.columns

Index(['GEOID', 'SUMLEV', 'STATE', 'COUNTY', 'CBSA', 'CSA', 'NECTA', 'CNECTA',
       'NAME', 'POP100', 'HU100', 'POP100.2000', 'HU100.2000', 'P001001',
       'P001001.2000'],
      dtype='object')

---

In [ ]:
# Saving the changes made to a csv